# <u>Lecture 5 Lab Exercises</u>

<span style="color:green"> I did all the required exercises and fully understand them.</span>

Exercise | Comments
---|---
7.23|Done
8.3|Done
8.8|Done

## _**7.23** Data Science: Pandas DataFrames_

I was able to perform each part as decribed in the exercises using the Pandas library. I feel comfortable creating, slicing, dicing, transposing and sorting dataframes.

#### (a) Create a DataFrame named temperatures from a dictionary of three temperature readings each for 'Maxine', 'James' and 'Amanda'.

In [1]:
import pandas

In [2]:
temperatures = pandas.DataFrame({
    'Maxine': [22,23,24],
    'James': [23,27,28],
    'Amanda': [20,26,21]
})

In [3]:
temperatures

   Maxine  James  Amanda
0      22     23      20
1      23     27      26
2      24     28      21

#### (b) Recreate the DataFrame temperatures in Part (a) with custom indices using the index keyword argument and a list containing 'Morning', 'Afternoon' and 'Evening'.

In [4]:
temperatures.index = ['Morning', 'Afternoon', 'Evening']

In [5]:
temperatures

           Maxine  James  Amanda
Morning        22     23      20
Afternoon      23     27      26
Evening        24     28      21

#### (c) Select from temperatures the column of temperature readings for 'Maxine'.

In [6]:
temperatures['Maxine']

Morning      22
Afternoon    23
Evening      24
Name: Maxine, dtype: int64

#### (d) Select from temperatures the row of 'Morning' temperature readings.

In [7]:
temperatures.loc['Morning']

Maxine    22
James     23
Amanda    20
Name: Morning, dtype: int64

#### (e) Select from temperatures the rows for 'Morning' and 'Evening' temperature readings.

In [8]:
temperatures.loc[['Morning', 'Evening']]

         Maxine  James  Amanda
Morning      22     23      20
Evening      24     28      21

#### (f) Select from temperatures the columns of temperature readings for 'Amanda' and 'Maxine'.

In [9]:
temperatures[['Amanda', 'Maxine']]

           Amanda  Maxine
Morning        20      22
Afternoon      26      23
Evening        21      24

#### (g) Select from temperatures the elements for 'Amanda' and 'Maxine' in the 'Morning' and 'Afternoon'.

In [10]:
temperatures.loc['Morning':'Afternoon',['Amanda', 'Maxine']]

           Amanda  Maxine
Morning        20      22
Afternoon      26      23

#### (h) Use the describe method to produce temperaturesâ€™ descriptive statistics.

In [11]:
temperatures.describe()

       Maxine      James     Amanda
count     3.0   3.000000   3.000000
mean     23.0  26.000000  22.333333
std       1.0   2.645751   3.214550
min      22.0  23.000000  20.000000
25%      22.5  25.000000  20.500000
50%      23.0  27.000000  21.000000
75%      23.5  27.500000  23.500000
max      24.0  28.000000  26.000000

#### (i) Transpose temperatures.

In [12]:
temperatures.T

        Morning  Afternoon  Evening
Maxine       22         23       24
James        23         27       28
Amanda       20         26       21

#### (j) Sort temperatures so that its column names are in alphabetical order.

In [13]:
temperatures.sort_index(axis = 1)

           Amanda  James  Maxine
Morning        20     23      22
Afternoon      26     27      23
Evening        21     28      24

## _**8.3** Pig Latin_

I was able to define a function `pig_latin` which converts an input English string to an output pigLatin string. I have made comments throughout my code to eplain the logic.

In [14]:
def pig_latin(string):
    
    """ The function encodes English-language phrases into a form of coded language called pig Latin."""
    
    #Split the input string into a list of individual words
    words = string.split(" ")
    
    #Define empty variable output
    output = ""
        
    #Iterate through each word
    for word in words:
        #Convert the word to lowercase
        word = word.lower()
        
        #If word starts with a vowel
        if word[0] in ['a', 'e', 'i', 'o', 'u']:
            #Add 'ay' in the end
            word += 'ay'
            
        #If word doesn't start with a vowel
        else:
            #Add first character and 'ay' in the end
            word += word[0] + 'ay'
            #Drop first character
            word = word[1:]
        
        #Add modfied word and space to output
        output += word + " "

    #Return output except last space
    return output[:-1]

In [15]:
string = 'Hello my name is pig and i am a dirty animal'
pig_latin(string)

'ellohay ymay amenay isay igpay anday iay amay aay irtyday animalay'

## _**8.8** Converting Integers to Emojis_

The following code prints the first 10 emojis beginning with a smiley face, using a `loop` and a `f-string`.

In [16]:
print(f'{"Unicode":>5}{"Emoji":>8}')
for a in range(10):
    code = "0x1F60" + str(a)
    print(f'{int(code, 16):>5}{int(code, 16):>7c}')

Unicode   Emoji
128512      ðŸ˜€
128513      ðŸ˜
128514      ðŸ˜‚
128515      ðŸ˜ƒ
128516      ðŸ˜„
128517      ðŸ˜…
128518      ðŸ˜†
128519      ðŸ˜‡
128520      ðŸ˜ˆ
128521      ðŸ˜‰